Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ངན་སོང་ན་གནས་པས་ཀྱང་ཁ་དོག་རྒྱས་པའི་བུད་མེད་མཐོང་ན་འདུ་ཤེས་བཞི་སྐྱེད་དེ། བཞི་གང་ཞེ་ན། ཉམས་པར་འདུ་ཤེས་པ་དང་། གཡང་སར་འདུ་ཤེས་པ་དང་། ཕྱིས་ཁུང་དུ་འདུ་ཤེས་པ་དང་། རྣག་ཏུ་བློས་ཉེ་བར་དཔྱོད་ཅིང་འདུ་ཤེས་པའོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ངན་སོང་ན་གནས་པ་ན་ཡང་ཁ་དོག་རྒྱས་པའི་བུད་མེད་མཐོང་ན་འདུ་ཤེས་འདི་བཞི་སྐྱེད་ན། མིར་གྱུར་པ་ན་ལྟ་ཅི་སྨོས་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པའི་རིགས་ཀྱི་བུས་ཁ་དོག་རྒྱས་པའི་བུད་མེད་མཐོང་ན་འདུ་ཤེས་འདི་བཞི་སྐྱེད་དེ། ཉམས་པར་འདུ་ཤེས་པ་དང་། གཡང་སར་འདུ་ཤེས་པ་དང་། ཕྱིས་ཁུང་དུ་འདུ་ཤེས་པ་དང་། རྣག་ཏུ་བློས་ཉེ་བར་དཔྱོད་ཅིང་འདུ་ཤེས་པའོ། ། གལ་ཏེ་དེ་ལྟར་བརྟགས་ཀྱང་འདོད་ཆགས་ཀྱི་སེམས་སྐྱེ་བ་ལྟ་ན། དེས་འདུ་ཤེས་གསུམ་བསྐྱེད་པར་བྱའོ། ། གསུམ་གང་ཞེ་ན། མ་འདྲ་བ་ལ་མར་འདུ་ཤེས་པ་དང་། སྲིང་མོ་འདྲ་བ་ལ་སྲིང་མོར་འདུ་ཤེས་པ་དང་། བུ་མོ་འདྲ་བ་ལ་བུ་མོར་འདུ་ཤེས་པ་སྟེ། འདུ་ཤེས་འདི་གསུམ་བསྐྱེད་པར་བྱའོ་ཞེས་དེ་ལྟར་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེས་ལེགས་པར་བཤད་པ་ཁོང་དུ་ཆུད་ནས་མདོ་སྡེ་དང་འཐུན་པར་བྱའོ། ། ཡུན་རིང་པོ་ནས་བདག་གི་མར་མ་གྱུར་པའམ། ཕར་མ་གྱུར་པའི་སེམས་ཅན་དེ་ལྟ་བུ་རྙེད་པར་སླ་བ་མ་ཡིན་ཏེ། སེམས་ཅན་ཐམས་ཅད་བདག་གི་མ་དང་། ཕར་གྱུར་པས་མ་ཉིད་ཆུང་མར་བྱ་བའི་མི་རིགས་སོ་ཞེས་དེ་ལྟར་བསླབ་པར་བྱའོ། ། བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ནི་མི་འཐུན་པ་ལ་གནས་ཀྱིས། བདག་ནི་མི་འཐུན་པ་ལ་གནས་པར་མི་བྱའོ། ། དེ་ལྟར་སྤྱད་ཀྱང་འདོད་ཆགས་ཀྱི་སེམས་དེ་ཉིད་རྗེས་སུ་འབྲང་བ་ལྟ་ན། དེས་ཚུལ་བཞིན་དུ་སོ་སོར་བརྟག་པར་བྱའོ། །
en: “Śāriputra, even if, in the lower states of existence, the bodhisatva were to set eyes on a woman with perfect features, four things would come to his mind. What are these four things? He would think of her as vile. He would think of her as a precipice. He would think of her as a latrine. He would relate to her as one does to pus. These, Śāriputra, are the four things that would come to the mind of the bodhisatva even if he, in the lower states of existence, were to set eyes on a woman with perfect features. If he were a human being, Śāriputra, a son of good family who had entered the Mahāyāna, and he were to set eyes on a woman with perfect features, four thoughts would certainly come to his mind. What are these four thoughts? He would think of her as vile. He would think of her as a precipice. He would think of her as a latrine. He would relate to her as one does to pus. If, with these considerations in mind, he were still to feel desire, he should then cultivate three thoughts. What are these three thoughts? If she resembles a mother he should think of her as his mother. If she resembles a sister he should think of her as his sister. If she resembles a daughter he should think of her as his daughter. These are the three thoughts he should cultivate. “Śāriputra, the bodhisatva who absorbs these excellent words of mine will see things in accordance with the way they are presented in the sūtras: ‘It is not easy to encounter a sentient being who has not throughout the extent of time been my mother or my father. All sentient beings have been my parents, and so one is indeed taking one’s mother as one’s wife!’ This is how one should train. This would not be in harmony with the practice of all immature ordinary people, and I would not wish to infringe upon the customs of immature ordinary people.

source: འདི་ལྟ་སྟེ། འདོད་ཆགས་ཀྱི་སེམས་སྐྱེས་ན་དེ་ཅི་མཐོང་བ་ལས་སྐྱེས། འོན་ཏེ་འདོད་ཆགས་དེ་མིག་ལས་གྱུར་ན་དེས་འདི་ལྟར་ཚུལ་བཞིན་དུ་སོ་སོར་བརྟག་པར་བྱའོ། ། བདག་མིག་ལ་ཆགས་ན་ཅི་མིག་གིས་མིག་མཐོང་ངམ། །དེ་ཅི་རང་བཞིན་གྱིས་རང་བཞིན་མཐོང་ངམ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ཡང་མིག །འདི་ཡང་མིག་གོ ། དེ་ཡང་འབྱུང་བ་ཆེན་པོ་ལས་གྱུར་པ་སྟེ། དེ་ཡང་འབྱུང་བ་ཆེན་པོ་ལས་བྱུང་བའོ། ། འདི་ཡང་འབྱུང་བ་ཆེན་པོ་ལས་བྱུང་བ་སྟེ། རང་བཞིན་གྱིས་རང་བཞིན་ལ་མི་ཆགས། བདག་གིས་བདག་རང་ལ་འང་མ་ཡིན་ནོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ཇི་ཙམ་པ་འདི་ཡང་དེ་ཙམ་སྟེ། དེ་ལ་ཆགས་པ་དང་། འདི་ལ་ཆགས་པ་དེ་དག་ནི་ཁྱད་པར་མེད་དེ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ནི་ཁྱད་པར་མེད་པར་གནས་སོ། ། བདག་ནི་ཁྱད་པར་ཅན་དུ་འདོད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟ་སྟེ། འདོད་པ་ལ་རྣམ་པར་རྟོག་པ་དེ་ལྟ་བུ་ནི་ཡོན་ཏན་མ་ཡིན་ནོ། །
en: “When one is following a particular course of action and thoughts of desire arise, one should properly investigate the arising of this state of desire to see whether it is visual perception that is the source of this mental event. One should properly investigate whether the desire is located in the eye, reflecting, ‘If my desires were located in the eye, how could the eye be observing the eye? Can an essence perceive its own essence? How could that be? There would then be that eye and this eye. That eye would be related to the element, and this eye would be the production of the element. In the context of the production of elements, a real essence cannot desire a real essence, or its own being. Why is this? If that is just the same as this, there is no difference between desiring that and desiring this. All immature ordinary people fail to make this distinction. I, however, wish to be someone who sees distinctions. Why do I wish this? I wish this because someone who wishes for desires is without good qualities.’ ”

source: ཕན་ཚུན་དག་ནི་དོན་གཅིག་སྟེ། ། དེ་ལ་ཁྱད་པར་ཡོད་མེད་པ། །དེ་ནི་ཚུལ་བཞིན་མ་ཡིན་འཛིན། ། འདོད་ཆགས་སེམས་ནི་ཀུན་ནས་ལངས། །
en: “There is one thing that is common to everyone—And no one is different in this regard—And that is that the mind of desire Follows along with the grasping born of superficiality.

source: འདི་ནི་འབྱུང་ལས་གྱུར་པ་སྟེ། ། འབྱུང་བ་ཆེ་ལ་ཇི་ལྟར་ཆགས། །
en: “How can something come from something, And how can there be desire for an element?

source: ཆོས་འདི་རྣམས་ནི་ཤིང་འདྲ་སྟེ། །དེ་ལ་ཆགས་འགྱུར་གང་ཡང་མེད། །
en: Phenomena are like logs—There is nothing there to desire.

source: འདི་ནི་བདག་གིས་བརྟགས་པ་སྟེ། །ཡང་དག་མིན་གྱིས་ཀུན་ནས་ལངས། །
en: “I have analyzed these things and come to see That things arise without any reality.

source: མེད་པ་ལས་ནི་འདོད་ཆགས་སྐྱེ། །
en: The unreal is what gives rise to desire.

source: འདོད་ཆགས་ཉིད་ཀྱང་ཡོད་མ་ཡིན། །
en: One cannot find any reality in desire.

source: ཕྱོགས་བཅུ་རྣམས་སུ་བཙལ་ན་ཡང་། །འདོད་ཆགས་ཡོད་པ་མ་ཡིན་ཏེ། །
en: “Even if one searches in all ten directions, One cannot find any reality to desire.

source: ཡང་དག་མ་ཡིན་ཡོངས་བརྟགས་པས། །འདོད་ཆགས་སེམས་ནི་ཀུན་ནས་ལངས། །
en: It is only by means of misconceptions That the mind of desire arises.

source: གལ་ཏེ་དེ་ལྟར་སོ་སོར་བརྟགས་ཀྱང་འདོད་ཆགས་ཀྱི་སེམས་དེ་ཉིད་རྗེས་སུ་འབྲང་བ་ལྟ་ན་དེས་དམ་པ་རྒྱ་ཆེར་ལེགས་པར་བཤད་པ་ཁོང་དུ་ཆུད་ཅིང་མདོ་སྡེ་ལ་མཁས་པས་རབ་ཏུ་མདོ་སྡེ་དང་རྗེས་སུ་འཐུན་པར་བྱའོ། །
en: “If one properly investigates how desire arises in the mind in this way, one will take the greatness of my instructions to heart. A master of discourses should be in agreement with the explanations found in the sūtras:

source: མིག་འདི་ནི་དབུ་བ་དང་འདྲ་སྟེ། མ་ཉེར་མི་བཟོད་དོ། ། དབུ་བ་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད། སྲོག་མེད། གང་ཟག་མེད། སྐྱེས་བུ་མེད། ཤེད་ལས་སྐྱེས་མེད། ཤེད་བུ་མེད། བྱེད་པ་པོ་མེད། ཚོར་བ་པོ་མེད་དེ། དེ་ལྟར་བྱེད་པ་མེད་པའི་ཆོས་ལ་སུ་ཞིག་ཆགས་པར་འགྱུར། མིག་འདི་ནི་ཆུའི་ཆུ་བུར་དང་འདྲ་སྟེ། རང་བཞིན་གྱིས་སྙིང་པོ་མེད་པའོ། །
en: “The eye is like a bubble—it bursts under strain. A bubble has no self, no being, no life force, no person, no man, no human being, no soul, no one who acts, and no one who experiences. Where then can there be someone filled with desire? Who would desire that which is powerless and ineffective?

source: ཆུའི་ཆུ་བུར་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད། སྲོག་མེད། གང་ཟག་མེད། སྐྱེས་བུ་མེད། ཤེད་ལས་སྐྱེས་མེད། ཤེད་བུ་མེད་བྱེད་པ་པོ་མེད། ཚོར་བ་པོ་མེད་དེ། དེ་ལྟར་བྱེད་པ་མེད་པ། གཡོ་བ་མེད་པའི་ཆོས་ལ་སུ་ཞིག་ཆགས་པར་འགྱུར། མིག་འདི་ནི་སྨིག་རྒྱུ་དང་འདྲ་སྟེ། ལས་དང་། ཉོན་མོངས་པ་དང་། སྲེད་པ་ལས་བྱུང་བའོ། །
en: “The eye is like froth on water—it has no essential nature. Froth has no self, no being, no life force, no person, no man, no human, no soul, no one who acts, and no one who experiences. Who would desire that which is powerless and ineffective?

source: སྨིག་རྒྱུ་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད། སྲོག་མེད། གང་ཟག་མེད། སྐྱེས་བུ་མེད། ཤེད་ལས་སྐྱེས་མེད། ཤེད་བུ་མེད། བྱེད་པ་པོ་མེད། ཚོར་བ་པོ་མེད་དེ། དེ་ལྟར་བྱེད་པ་མེད་པ། གཡོ་བ་མེད་པའི་ཆོས་ལ་སུ་ཞིག་ཆགས་པར་འགྱུར།
en: “The eye is like a mirage—it comes about through action, vice, and desire. A mirage has no self, no being, no life force, no person, no man, no human, no soul, no one who acts, and no one who experiences. Who would desire those things that are powerless and ineffective? Where does desire take place?

source: མིག་འདི་ནི་ཆུ་ཤིང་དང་འདྲ་སྟེ། རང་བཞིན་གྱིས་སྙིང་པོ་མེད་པའོ། ། ཆུ་ཤིང་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད་པ་ནས་སུ་ཞིག་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is like a plantain tree—it has no essential nature. The plantain tree has no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་སྒྱུ་མ་དང་འདྲ་སྟེ། ཕྱིན་ཅི་ལོག་ལས་བྱུང་བའོ། །སྒྱུ་མ་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད་པ་ནས་སུ་ཞིག་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is like an illusion—it appears due to trickery. An illusion has no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་རྨི་ལམ་དང་འདྲ་སྟེ། མི་བདེན་པ་ཡང་དག་པ་མ་ཡིན་པ་མཐོང་བའོ། ། རྨི་ལམ་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད་པ་ནས་སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུའོ།
en: “The eye is like a dream—it sees things in a distorted and false manner. A dream has no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་བྲག་ཅ་དང་འདྲ་སྟེ། རྐྱེན་གྱི་ཁ་ན་ལུས་པའོ། ། བྲག་ཅ་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད་པ་ནས། སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is like an echo—it is dependent upon conditions. An echo has no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་གཟུགས་བརྙན་དང་འདྲ་སྟེ། ལས་ཀྱི་གཟུགས་བརྙན་གྱིས་ཀུན་ཏུ་སྣང་བའོ། ། གཟུགས་བརྙན་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད་པ་ནས་སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is like a reflection—it is seen through the mirror of karma. A reflection has no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་སྤྲིན་དང་འདྲ་སྟེ། གསལ་བ་འཁྲུག་པ་དང་བྲལ་བའི་མཚན་ཉིད་དོ། ། སྤྲིན་ལ་ཡང་བདག་མེད། སེམས་ཅན་མེད་པ་ནས། སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུ་འོ། །
en: “The eye is like a cloud—it is ever changing and lacks any essential characteristics. A cloud has no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་གློག་དང་འདྲ་སྟེ། སྐད་ཅིག་གིས་འཇིག་པ་དང་ལྡན་པའོ། ། གློག་ལ་ཡང་བདག་མེད། ། སེམས་ཅན་མེད་པ་ནས། སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is like lightning—it is gone in an instant. Lightning has no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་སྟོང་པ་དང་འདྲ་སྟེ། བདག་དང་བདག་གི་དང་བྲལ་བའོ། ། དེ་ལྟར་ཆོས་རྣམས་སྟོང་པ་སྟེ། བདག་མེད་སེམས་ཅན་མེད་པ་ནས། སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is like something empty, with no self or ownership. Things that are empty have no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་བེམས་པོ་ལྟ་བུ་སྟེ། རྩྭ་དང་། ཤིང་དང་། རྩིག་པ་དང་། རྡོ་བ་དང་། མིག་ཡོར་ལྟ་བུའོ། ། དེ་ལྟར་ཆོས་ཐམས་ཅད་བེམས་པོ་སྟེ། བདག་མེད། སེམས་ཅན་མེད་པ་ནས་སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is like lifeless matter, like grass, plaster, wood, rock, or a reflection. All phenomena are like lifeless matter, and they have no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་གཡོ་བ་མེད་པ་སྟེ། རླུང་གིས་འཁྲུལ་འཁོར་དང་ལྡན་པས་འདུག་པའོ། ། དེ་ལྟར་ཆོས་ཐམས་ཅད་བྱེད་པ་མེད་དེ། བདག་མེད། སེམས་ཅན་མེད་པ་ནས། སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is helpless, as if caught in a whirlwind. All phenomena are helpless, and they have no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་གསོབ་སྟེ། མི་གཙང་བ་དང་། རྣག་གི་ཚོགས་སོ། །དེ་ལྟར་ཆོས་ཐམས་ཅད་གསོབ་སྟེ། བདག་མེད། སེམས་ཅན་མེད་པ་ནས། སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is worthless, like a heap of pus and excrement. All phenomena are worthless, and they have no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་གསོག་སྟེ། འཇིག་པ་དང་། འགྱེས་པ་དང་། འབྱེ་བ་དང་། འཐོར་བ་དང་། འཛོམས་པའི་ཆོས་ཅན་ནོ། ། དེ་ལྟར་ཆོས་ཐམས་ཅད་གསོག་སྟེ། བདག་མེད། སེམས་ཅན་མེད་པ་ནས། སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is useless, like something that is worn out, damaged, broken, decayed, and ruined. All phenomena are useless, and they have no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་ཁྲོན་པ་རྙིང་བ་དང་འདྲ་སྟེ། རྟག་ཏུ་རྒ་བའི་ཟིལ་གྱིས་ནོན་ཏོ། ། དེ་ལྟར་ཆོས་ཐམས་ཅད་ཁྲོན་པ་རྙིང་བ་དང་འདྲ་སྟེ། བདག་མེད། སེམས་ཅན་མེད་པ་ནས། སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར་བའི་བར་དུའོ། །
en: “The eye is like a dried-up well, overcome by age. All phenomena are like dried-up wells, and they have no self, no being, and so forth. Who would desire these things? Where is such desire to be found?

source: མིག་འདི་ནི་ཐ་མར་མི་གནས་པ་སྟེ། ཐ་མར་འཆི་བའོ། ། དེ་ལྟར་ཆོས་ཐམས་ཅད་ནི་མཐར་མི་གནས་པ་སྟེ། བདག་མེད། སེམས་ཅན་མེད། སྲོག་མེད། གང་ཟག་མེད། སྐྱེས་བུ་མེད། ཤེད་ལས་སྐྱེས་མེད། ཤེད་བུ་མེད། བྱེད་པ་པོ་མེད། ཚོར་བ་པོ་མེད་དེ། དེ་ལྟར་བྱེད་པ་མེད་ཅིང་རྐྱེན་འདུས་པ་ལས་བྱུང་བ་དེ་ལ་སུ་ཞིག་ཆགས་པར་འགྱུར། གང་དུ་ཆགས་པར་འགྱུར། དེ་བཞིན་དུ་ནང་དང་། ཕྱིའི་སྐྱེ་མཆེད་ཐམས་ཅད་ལ་ཡང་རྒྱས་པར་སྦྱར་བར་བྱའོ། །
en: “The eye is not something that will last—its passing is inevitable. No phenomena will last, and they have no self, no being, no life force, no person, no man, no human, no soul, no one who acts, and no one who experiences. Who would desire those things that are powerless and ineffective, that are dependent upon conditions? Where is such desire to be found? “One should go through all the outer and inner sense fields in this way.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ཚུལ་བཞིན་རབ་ཏུ་སྦྱོར་བའི་བྱང་ཆུབ་སེམས་དཔའ་འདོད་ཆགས་ཀྱིས་མི་འཕྲོགས་ཏེ། དེ་ལྟ་བུའི་གནས་མེད་དོ། ། དེ་ཆོས་ཐམས་ཅད་ལ་འདོད་ཆགས་དང་བྲལ་བ་ཡིན་ནོ། ། ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའོ། །
en: “Śāriputra, the bodhisatva who applies himself correctly in this manner will not be disturbed by passion. This is impossible. He will remain passionless in the face of all phenomena. This, Śāriputra, is the purity of the morality of the bodhisatva, the great being.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྣམ་པ་ཐམས་ཅད་དུ་སྲོག་ཆགས་ལ་གསོད་པར་མི་བྱེད་དེ། སྲོག་ཆགས་སུ་གྱུར་པ་ཐམས་ཅད་ལ་གནོད་པ་མ་ཡིན་ནོ། ། སྲོག་གི་ཕྱིར་ཡང་རྣམ་པ་ཐམས་ཅད་དུ་མ་བྱིན་པར་མི་ཕེན་ཏེ། གཞན་གྱི་ལོངས་སྤྱོད་ལ་མི་རྐུ་བ་ཡིན་ནོ། ། སྲོག་གི་ཕྱིར་ཡང་རྣམ་པ་ཐམས་ཅད་དུ་འདོད་པས་ལོག་པར་གཡེམ་པ་མི་སྟེན་ཏེ། གཞན་གྱི་ཆུང་མ་ལ་སྙིང་ཆགས་པར་མི་བྱེད་དོ། ། སྲོག་གི་ཕྱིར་ཡང་བརྫུན་གྱི་ཚིག་མི་སྨྲ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་མི་སླུ་བ་ཡིན་ནོ། ། བདག་གི་གཡོག་གིས་ཆོག་པས་ཕྲ་མའི་ཚིག་མི་ཟེར་བ་ཡིན་ནོ། ། སྲོག་གི་ཕྱིར་ཡང་ཕྲ་མའི་ཚིག་མེད་པ་ཡིན། ཚིག་གཞན་མི་སྨྲ་བས་ཚིག་ཚོད་བཟུང་བ་ཡིན། སྲོག་གི་ཕྱིར་ཡང་གཞན་གྱི་ལོངས་སྤྱོད་ལ་བརྣབ་སེམས་མི་སྐྱེད་པས་གཞན་གྱི་ལོངས་སྤྱོད་ལ་བརྣབ་སེམས་མེད་པ་ཡིན། སྲོག་གི་ཕྱིར་ཡང་ངན་དུ་སྨྲ་བ་དང་། ངན་དུ་རྗོད་པའི་ཚིག་དང་དུ་ལེན་པས་མི་ཁྲོ་ཞིང་བཟོད་པ་ཡིན། སངས་རྒྱས་ལ་སྐྱབས་སུ་སོང་བས་སྲོག་གི་ཕྱིར་ཡང་ལོག་པར་ལྟ་བ་མི་སྤྱོད་དེ། ལྷ་གཞན་མེད་པ་ཡིན།
en: “Śāriputra, the pure morality of the bodhisatva, the great being, is such that he will not kill any being under any circumstances. He will not harm anything that possesses life. He will not take anything that has not been given to him under any circumstances, even if his life depends on it. He does not steal the property of others. He will not engage in sexual misconduct under any circumstances, even if his life depends on it. He does not lust for the wife of another. He will not tell a lie under any circumstances, even if his life depends on it. He does not violate the trust of any sentient being. He will not condone slanderous remarks among those who are associated with him. Even if his life depended on it, he would still not engage in inane chatter. He measures his words and avoids saying anything irrelevant. He will not covet another’s possessions, even if his life depends on it. He will not become angry, even if his life depends on it, but will patiently accept harsh and slanderous remarks. He will not adopt wrong views even if his life depends on it. He will go for refuge to the Buddha and will not have recourse to any other divinity.

source: དེ་ཡེ་ཤེས་གཞན་ལ་རེ་བ་མེད་པས་མ་ཉམས་པའི་ཚུལ་ཁྲིམས་ཡིན། ངན་པར་སྐྱེ་བ་ཡོངས་སུ་སྤངས་པས་སྐྱོན་མེད་པའི་ཚུལ་ཁྲིམས་ཡིན། འགྲོ་བ་ངན་པ་ཉོན་མོངས་པ་རྣམས་དང་མ་འདྲེས་པས་འདྲེན་མ་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་ཡིན། ཆོས་དཀར་པོ་གཅིག་ཏུ་རྣམ་པར་འཕེལ་བས་སྲ་སྲེ་མེད་པའི་ཚུལ་ཁྲིམས་ཡིན། ཇི་ལྟར་འདོད་པ་བཞིན་དུ་འགྲོ་བས་རང་དབང་གི་ཚུལ་ཁྲིམས་ཡིན། འགྲོ་བ་མཁས་པས་མ་སྨད་པས་བསྔགས་པའི་ཚུལ་ཁྲིམས་ཡིན། དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པའི་ཤིན་ཏུ་བསྲུངས་པའི་ཚུལ་ཁྲིམས་ཡིན། ཉེས་པ་ཐམས་ཅད་དུ་མི་སྐྱེ་བས་མ་སྨད་པའི་ཚུལ་ཁྲིམས་ཡིན། དབང་པོའི་སྒོ་བསྡམས་པས་ཤིན་ཏུ་སྦས་པའི་ཚུལ་ཁྲིམས་ཡིན། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་དགོངས་པས་རྣམ་པར་བསྒྲགས་པའི་ཚུལ་ཁྲིམས་ཡིན། རུང་བ་ལ་ཆོག་ཤེས་པས་འདོད་པ་ཉུང་བའི་ཚུལ་ཁྲིམས་ཡིན། སྤོང་བ་ལ་དགའ་བའི་ཆོག་ཤེས་པའི་ཚུལ་ཁྲིམས་ཡིན། ལུས་དང་སེམས་རབ་ཏུ་དབེན་པས་ནན་ཏན་གྱི་ཚུལ་ཁྲིམས་ཡིན། འདུ་བ་ལ་མི་དགའ་བས་དགོན་པ་ལ་གནས་པའི་ཚུལ་ཁྲིམས་ཡིན། གཞན་གྱི་གདོང་དུ་མི་ལྟ་བས་འཕགས་པའི་རིགས་ལ་དགའ་བའི་ཚུལ་ཁྲིམས་ཡིན། བདག་གི་ཁ་ན་ལས་པའི་དགེ་བའི་རྩ་བ་སྐྱེད་པས་སྦྱངས་པའི་ཡོན་ཏན་གྱི་ཚུལ་ཁྲིམས་ཡིན། ལྷ་དང་མི་རྣམས་ལ་མི་སླུ་བས་ཇི་ལྟར་སྨྲས་པ་དེ་ལྟར་བྱེད་པའི་ཚུལ་ཁྲིམས་ཡིན། སེམས་ཅན་ཐམས་ཅད་ལ་མི་འཚེ་བས་བྱམས་པའི་ཚུལ་ཁྲིམས་ཡིན།
en: “He maintains his morality unblemished by not striving after any other type of knowledge. He keeps his morality unbroken by avoiding anything that is incompatible with the Dharma. He keeps his morality unadulterated by not associating with wicked people who indulge in vices. He keeps his morality spotless by only promoting wholesome ways of acting. He keeps his morality free by following his own inclinations. He keeps his morality respectful and is not censured by those who are knowledgeable. He preserves his morality by remaining mindful and aware. He keeps his morality irreproachable by not letting any mistakes occur. He safeguards his morality by guarding the doors of the senses. He guards his reputation for pure morality because it is in accord with the intent of all the buddhas. He maintains the morality of requiring little by knowing what the proper measures are. He maintains the morality of contentment and easily avoids greed. He maintains the morality of persistence by isolating his body and his mind. He maintains the morality of the hermit by shunning society. He maintains the morality of the tradition of the noble ones by not looking another directly in the face. He maintains the morality of upholding the qualities of a purified one by generating the roots of virtue of a life of self-reliance. He maintains the morality of integrity by not violating his promises to gods and men. He maintains the morality of love through the attitude of not causing harm to any sentient being.

source: སྡུག་བསྔལ་ཐམས་ཅད་དང་དུ་ལེན་པས་སྙིང་རྗེའི་ཚུལ་ཁྲིམས་ཡིན། ཆོས་ལ་དགའ་ཞིང་ཞུམ་པ་མེད་པས་དགའ་བའི་ཚུལ་ཁྲིམས་ཡིན། རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤངས་པས་བཏང་སྙོམས་ཀྱི་ཚུལ་ཁྲིམས་ཡིན། རང་གི་སེམས་ངེས་པར་རྟོགས་པས་བདག་གི་འཁྲུལ་པ་ལ་སོ་སོར་རྟོག་པའི་ཚུལ་ཁྲིམས་ཡིན། གཞན་གྱི་སེམས་རྗེས་སུ་སྲུང་བས་གཞན་གྱི་འཁྲུལ་པ་ལ་ཉེས་པར་མི་ལྟ་བའི་ཚུལ་ཁྲིམས་ཡིན། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སེམས་ཅན་ཡོངས་སུ་སྦྱིན་པར་བྱེད་པའི་ཚུལ་ཁྲིམས་ཡིན། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཤིན་ཏུ་བསྲུངས་པའི་ཚུལ་ཁྲིམས་ཡིན། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཁོང་ཁྲོ་བ་མེད་པའི་ཚུལ་ཁྲིམས་ཡིན། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་དགེ་བའི་ཆོས་མི་ཟློགས་པའི་ཚུལ་ཁྲིམས་ཡིན། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་བསམ་གཏན་གྱི་ཡན་ལག་ཡོངས་སུ་རྫོགས་པའི་ཚུལ་ཁྲིམས་ཡིན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཐོས་པ་རབ་ཀྱི་ཚུལ་ཁྲིམས་ཡིན། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཚོགས་བསགས་པས་དགེ་བའི་བཤེས་གཉེན་ལ་སྟེན་པའི་ཚུལ་ཁྲིམས་ཡིན། ལམ་ངན་པ་ཡོངས་སུ་སྤོང་བས་སྡིག་པའི་གྲོགས་པོ་ཡོངས་སུ་སྤོང་བའི་ཚུལ་ཁྲིམས་ཡིན། མི་རྟག་པའི་འདུ་ཤེས་སོ་སོར་རྟོག་པས་ལུས་ལ་མི་ལྟ་བའི་ཚུལ་ཁྲིམས་ཡིན། ཡིད་མི་རྟོན་པས་སྲོག་ལ་མི་ལྟ་བའི་ཚུལ་ཁྲིམས་ཡིན། བསམ་པ་ཤིན་ཏུ་ཡོངས་སུ་དག་པས་མི་འགྱོད་པའི་ཚུལ་ཁྲིམས་ཡིན། རབ་ཏུ་སྦྱོར་བ་ཤིན་ཏུ་ཡོངས་སུ་དག་པས་བཅོས་མ་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་ཡིན། ལྷག་པའི་བསམ་པ་ཤིན་ཏུ་ཡོངས་སུ་དག་པས་ཡོངས་སུ་གདུང་བ་མེད་པའི་ཚུལ་ཁྲིམས་ཡིན། འདོད་ཆགས་དང་བྲལ་བས་མི་རྒོད་པའི་ཚུལ་ཁྲིམས་ཡིན། སྒྲུབ་པས་མི་སྙེམས་པའི་ཚུལ་ཁྲིམས་ཡིན། ཅང་ཤེས་པས་མུ་ཅོར་མི་སྨྲ་བའི་ཚུལ་ཁྲིམས་ཡིན། ཁྲོ་བ་མེད་པས་དུལ་བའི་ཚུལ་ཁྲིམས་ཡིན། ཉེ་བར་ཞི་བས་ཞི་བའི་ཚུལ་ཁྲིམས་ཡིན། ཇི་ལྟར་བསྒོ་བ་བཞིན་ལས་འགལ་བར་མི་བྱེད་པས་བཀའ་བློ་བདེ་བའི་ཚུལ་ཁྲིམས་ཡིན། བསྡུ་བའི་དངོས་པོ་རྗེས་སུ་མི་གཏོང་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཚུལ་ཁྲིམས་ཡིན། རང་གི་ནོར་རབ་ཏུ་མི་འཇིག་པས་ཆོས་རྗེས་སུ་སྲུང་བའི་ཚུལ་ཁྲིམས་ཡིན་ནོ། །
en: He maintains the morality of compassion by being moved by all forms of suffering. He maintains the morality of empathetic joy by delighting in the Dharma and not becoming discouraged. He maintains the morality of equanimity by ridding himself of attachment and aversion. He maintains the morality of examining his own mistakes by clearly discerning his own mind. He maintains the morality of not seeing faults in others’ mistakes and is considerate of the minds of others. He maintains the morality of bringing sentient beings to maturity through the perfection of generosity. He maintains the morality of guarding himself through the perfection of morality. He maintains the morality of not becoming angry through the perfection of patient acceptance. He maintains the morality of not turning away from the wholesome Dharma through the perfection of vigor. He maintains the morality of perfecting the factors of meditation through the perfection of meditation. He maintains the morality of excellent learning through the perfection of wisdom. He maintains the morality of relying on a spiritual friend and develops the necessary factors of awakening. He maintains the morality of avoiding bad influences by avoiding wicked paths. He maintains the morality of having no concern for his body by applying the idea of impermanence. He maintains the morality of having no concern for his life by not putting his trust in it. He maintains the morality of having no regrets by keeping his intentions perfectly pure. He maintains the morality of being uncontrived by keeping his engagement perfectly pure. He maintains the morality of avoiding burning desire by keeping his sincerity perfectly pure. He maintains the morality of modesty by remaining free from desire. He maintains the morality of unpretentiousness by keeping a low profile. He maintains the morality of not being foolish because of his noble nature. He maintains the morality of discipline through a lack of aggression. He maintains the morality of tranquility by remaining calm. He maintains the morality of being receptive by not being opposed to the statements of the buddhas. He maintains the morality of bringing sentient beings to maturity by not abandoning the methods for bringing people together. He maintains the morality of guarding the Dharma by not letting his resources diminish.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་ནི་འདི་ལྟ་བུའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། །
en: The learned bodhisatva’s skandha of morality is like this, Śāriputra, and with it he trains in the way of the bodhisatva.

source: ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་བརྩོན་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་རྣམས་བདུད་དང་། བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུས་མི་ཐུབ་པ་ཡིན། ཕས་ཀྱི་རྒོལ་བ་གཞན་དག་གིས་ཀྱང་མི་ཐུབ་པ་ཡིན་ནོ། །
en: “This, Śāriputra, is the perfection of morality of the bodhisatvas, the great beings, and when bodhisatvas apply themselves to it in their practice of the way of the bodhisatva, they cannot be overpowered by Māra and his retinue, nor by the gods. They cannot be overpowered by any opponent.”

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ་སྟེ། བདུན་པའོ།། །།
en: This is the seventh chapter, “The Perfection of Morality.”
